[
  {
    "id": 1,
    "importedAt": "2025-12-18T01:00:00.000Z",
    "title": "Cookie Clicker",
    "description": "<h3>The Ultimate Idle Clicker Game</h3>\n<p>Cookie Clicker is the original idle game where you click cookies to earn points and build a cookie empire. Start by clicking the giant cookie to earn your first cookies, then use those cookies to purchase upgrades and buildings that automatically generate cookies for you.</p>\n<h3>How to Play Cookie Clicker</h3>\n<p>The gameplay is simple but incredibly addictive. Click the big cookie to earn cookies manually, then spend your cookies wisely on various upgrades like cursors, grandmas, farms, and factories. Each upgrade produces cookies automatically, allowing you to earn even when you're not clicking. As you progress, unlock powerful upgrades and achievements that multiply your cookie production exponentially.</p>\n<h3>Features</h3>\n<ul>\n    <li><strong>Endless Progression:</strong> Build a massive cookie empire with hundreds of upgrades and buildings.</li>\n    <li><strong>Strategic Choices:</strong> Decide which upgrades to purchase for maximum efficiency.</li>\n    <li><strong>Achievements:</strong> Unlock special achievements and golden cookies for massive bonuses.</li>\n    <li><strong>Idle Gameplay:</strong> Your cookies keep generating even when you're away from the game.</li>\n</ul>\n<p>Start playing Cookie Clicker now and see how many cookies you can produce! If you enjoy idle games, check out more <a href=\"/play?category=casual\">Casual games</a> on our site.</p>",
    "iframe_url": "https://games.crazygames.com/en_US/cookie-clicker/index.html",
    "image_url": "https://images.crazygames.com/cookie-clicker/20210525094020/cookie-clicker-cover?auto=format%2Ccompress&q=75&cs=strip&ch=DPR&fit=crop",
    "category": "Casual",
    "page_url": "https://www.crazygames.com/game/cookie-clicker",
    "slug": "cookie-clicker",
    "image_alt": "Play Cookie Clicker online free - the original idle clicker game where you build a cookie empire",
    "image_title": "Cookie Clicker - Free Idle Clicker Game",
    "image_description": "Cookie Clicker is the classic idle game where you click a giant cookie to earn points and build an automated cookie production empire with upgrades and achievements.",
    "image_keywords": ["idle game", "clicker game", "cookie clicker", "casual game", "free browser game"],
    "image_processed": true
  }
]
